---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.SketchFailures.RebarSystemDirectionNotSpecifiedError
source: html/acdba844-7128-4b77-9f7f-b7a8c98d715f.htm
---
# Autodesk.Revit.DB.BuiltInFailures.SketchFailures.RebarSystemDirectionNotSpecifiedError Property

Major direction not specified.

## Syntax (C#)
```csharp
public static FailureDefinitionId RebarSystemDirectionNotSpecifiedError { get; }
```